Revit 2027 API
FormattedText.GetSuperscriptStatus Method
 Returns whether All, None or a Mixed of characters in the entire text are superscripted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatStatus GetSuperscriptStatus()
Public Function GetSuperscriptStatus As FormatStatus
public:
FormatStatus GetSuperscriptStatus()
member GetSuperscriptStatus : unit -> FormatStatus
Return Value
FormatStatus
 The format status of superscript on characters FormatStatus.
Remarks
 This function only returns All or None if the entire text contains one character.
See Also
Reference
FormattedText Class
GetSuperscriptStatus Overload
Autodesk.Revit.DB Namespace